const app = Vue.createApp({
    data() {
        // const 所有文件 = ['多标签散点图32×768.html', '多标签散点图32×1024.html', '多标签散点图32×1280.html', '多标签散点图32×512.html', '多标签散点图8×1024.html', '多标签散点图8×512.html', '模型对不同系列的准确率.html', '模型对不同角色的准确率.html', '模型对标签类别-准确率768.html'];
        const 所有文件 = ['多标签散点图32×768.html', '多标签散点图32×1024.html', '多标签散点图32×1280.html', '多标签散点图8×1024.html', '模型对标签大类-准确率768.html', '模型对标签类别-准确率768.html', '模型对不同系列的准确率.html', '模型对不同角色的准确率.html'];
        return {
            所有文件,
            当前文件: './' + 所有文件[0] 
        }
    },
    methods: {
        设置当前文件(x) {
            this.当前文件 = x;
        }
    }
})
window.onload = () => app.mount('#app')
